/*
The MIT License (MIT)
Copyright © 2022 Matt Wells

Permission is hereby granted, free of charge, to any person obtaining a copy of this
software and associated documentation files (the “Software”), to deal in the
Software without restriction, including without limitation the rights to use, copy,
modify, merge, publish, distribute, sublicense, and/or sell copies of the Software,
and to permit persons to whom the Software is furnished to do so, subject to the
following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT
HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF
CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/

#include "pch.h"
#include "modifications.h"
#include "memwrite.h"
#include "configTools.h"
#include "win_fall.h"

#include "Fall_General.h"
#include "Fall_Text.h"
#include "Fall_Scripts.h"
#include "Fall_Msg.h"
#include "Fall_GameMap.h"

#include "Dx_General.h"
#include "Dx_Windows.h"
#include "Dx_RenderTarget.h"
#include "Dx_Game.h"

using namespace std;
using namespace DirectX;
using namespace DirectX::PackedVector;

//WORLD_MAP.msg
#define WM_MSG_OFFSET_CITY_ENTRY_POINTS     200
#define WM_MSG_OFFSET_TERRAIN_TYPES         1000
#define WM_MSG_OFFSET_TERRAIN_UNKNOWN       1004
//MAP.msg
#define WM_MSG_OFFSET_SHORT_CITY_NAMES       1500


#define WM_NUM_SUB_TILES_X  7
#define WM_NUM_SUB_TILES_Y  6
#define WM_NUM_SUB_TILES   WM_NUM_SUB_TILES_X * WM_NUM_SUB_TILES_Y


LONG SFALL_ExpandWorldMap = 0;
LONG SFALL_WorldMapTerrainInfo = 0;
LONG SFALL_WorldMapTravelMarkers = 0;
LONG SFALL_WorldMapSlots = 17;


struct SCRIPT_DATA {
    DWORD unk00;
    DWORD unk08;
    DWORD unk0C;
    DWORD unk10;
};

struct TILE_DATA_CELL {
    DWORD terrain;//0x00;
    DWORD fill;//0x04;
    DWORD morning_chance;//0x08;
    DWORD afternoon_chance;//0x0C;
    DWORD night_chance;//0x10;
    DWORD enc_type;//0x14;
    DWORD fog_level;//0x18;
};

struct TILE_DATA {
    DWORD frmID;//0x00;
    DWORD frmObj;//0x04;
    BYTE* frmBuff;//0x08;
    char walk_mask_name[40];//0x0C
    BYTE* walk_mask_buff;//0x34; pointer to mask data 13200 bytes
    DWORD encounter_difficulty;//0x38;
    TILE_DATA_CELL cell[WM_NUM_SUB_TILES];//0x3C
};

struct ENTRANCE_DATA {
    LONG on_off;// DWORD unknown_0x00;
    LONG x_pos;// DWORD unknown_0x04;
    LONG y_pos;// DWORD unknown_0x08;
    LONG map_index;// DWORD unknown_0x0C;
    LONG elevation;// DWORD unknown_0x10;
    LONG tile_number;// DWORD unknown_0x14;
    LONG orientation;// DWORD unknown_0x18;
};

struct CITY_DATA {
    char area_name[40];
    LONG area_num;//0x28;
    LONG world_pos_x;//0x2C;
    LONG world_pos_y;//0x30;
    LONG size;//0x34;
    LONG start_state;//_0x38;
    LONG lock_state;//0x3C;
    DWORD unknown_0x40;
    DWORD townmap_art_frmID;//0x44;
    DWORD townmap_label_art_frmID;//0x48;
    LONG num_of_entrances;//0x4C;
    ENTRANCE_DATA entrance[10];//0x50
};

struct IMAGE_DETAILS {
    DWORD frmID;//0x00;
    DWORD width;//0x04;
    DWORD height;//0x08;
    FRMframeDx* pFrame;//0x0C; //previously void* frmObj;
    BYTE* buff;//0x10;
};

LONG* p_wm_num_tiles = nullptr;
LONG* p_wm_num_horizontal_tiles = nullptr;
TILE_DATA** pp_wm_tile_data = nullptr;

TILE_DATA_CELL** pp_wm_current_tile_cell = nullptr;

LONG* p_wm_num_cities = nullptr;
CITY_DATA** pp_wm_city_data = nullptr;


DWORD* p_wm_tick_count = nullptr;
LONG* p_wm_last_font = nullptr;

BYTE** pp_wm_win_buff = nullptr;


BOOL* p_wm_has_vehicle = nullptr;

IMAGE_DETAILS* p_worldSphereImage = nullptr;


DWORD* p_hotspot_width = nullptr;
DWORD* p_hotspot_height = nullptr;

LONG* p_wm_city_menu_scroll_limit = nullptr;// p_wmtabs_height = nullptr;

LONG* p_wm_city_list_final_pos = nullptr;
LONG* p_wm_city_list_offset_unit = nullptr;
LONG* p_wm_city_list_y_pos = nullptr;


FRMCached* pfrm_hotspot1 = nullptr;
FRMCached* pfrm_hotspot2 = nullptr;
FRMCached* pfrm_wmaptarg = nullptr;//wmaptarg.frm; World map move target maker #1
FRMCached* pfrm_wmaploc = nullptr;//wmaploc.frm; World map location maker
